#include "leetcode.hpp"

/* 1093. 大样本统计

我们对 0 到 255 之间的整数进行采样，并将结果存储在数组 count 中：count[k] 就是整数 k 的采样个数。

我们以 浮点数 数组的形式，分别返回样本的最小值、最大值、平均值、中位数和众数。
其中，众数是保证唯一的。

我们先来回顾一下中位数的知识：
	如果样本中的元素有序，并且元素数量为奇数时，中位数为最中间的那个元素；
	如果样本中的元素有序，并且元素数量为偶数时，中位数为中间的两个元素的平均值。

示例 1：
输入：count = [0,1,3,4,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]
输出：[1.00000,3.00000,2.37500,2.50000,3.00000]

示例 2：
输入：count = [0,4,3,2,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]
输出：[1.00000,4.00000,2.18182,2.00000,1.00000]

提示：
	count.length == 256
	1 <= sum(count) <= 10^9
	计数表示的众数是唯一的
	答案与真实值误差在 10^-5 以内就会被视为正确答案
*/

vector<double> sampleStats(vector<int>& count)
{
	vector<double> v;
	double sum = 0;
	int num = 0, N = 256, X = -1;
	int mode = -1, nmd = -1;
	for (int i = 0; i < 256; ++i)
	{
		if (count[i] == 0)
			continue;
		if (count[i] > nmd)
		{
			nmd = count[i];
			mode = i;
		}
		num += count[i];
		sum += 1.0 * i * count[i];
		N = min(N, i);
		X = max(X, i);
	}
	v.push_back(N);
	v.push_back(X);
	v.push_back(sum / num);

	int p1 = (num - 1) / 2, p2 = num / 2;
	sum = 0;
	num = 0;
	for (int i = 0; i < 256; ++i)
	{
		if (count[i] == 0)
			continue;
		num += count[i];
		if (num > p1)
		{
			sum += i;
			p1 = INT_MAX;
		}
		if (num > p2)
		{
			sum += i;
			p2 = INT_MAX;
		}
		if (p2 == INT_MAX)
			break;
	}
	v.push_back(sum / 2.0);
	v.push_back(mode);

	return v;
}

int main()
{}
